#Задание 1
#Выяснить тип результата выражений:
#15 * 3
#15 / 3
#15 // 2
#15 ** 2


print(15 * 3) # Выводим на экран результат вычисления
print(type(15 * 3)) # Определяем тип выражений с помощью функции type

print(15 / 3)
print(type(15 / 3))

print(15 // 2)
print(type(15 // 2))

print(15 ** 2)
print(type(15 ** 2))